nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f83000evk/demo_apps/mc_pmsm/pmsm_enc/peripherals.c
static void ADC_init(void) {
  /* Software reset Cyclic ADC. */
  SIM->PSWR2 |= SIM_PSWR2_CYCADC_MASK;
  SIM->PSWR2 &= ~ SIM_PSWR2_CYCADC_MASK;
#if defined(ADC_CTRL1_INIT)
  ADC->CTRL1 = ADC_CTRL1_INIT;
#endif /* ADC_CTRL1_INIT */
#if defined(ADC_CTRL2_INIT)
  ADC->CTRL2 = ADC_CTRL2_INIT;
#endif /* ADC_CTRL2_INIT */
#if defined(ADC_STAT_INIT)
  ADC->STAT = ADC_STAT_INIT;
#endif /* ADC_STAT_INIT */
#if defined(ADC_PWR_INIT)
  ADC->PWR = ADC_PWR_INIT;
#if (defined(ADC_PWR_INIT) && (((ADC_PWR_INIT) & (ADC_PWR_PD0_MASK | ADC_PWR_APD_MASK)) == 0UL))
while(((ADC->PWR) & ADC_PWR_PSTS0_MASK) != 0UL)
{}
#elif (defined(ADC_PWR_INIT) && (((ADC_PWR_INIT) & (ADC_PWR_PD1_MASK | ADC_PWR_APD_MASK)) == 0UL))
while(((ADC->PWR) & ADC_PWR_PSTS1_MASK) != 0UL)
{}
#elif (defined(ADC_PWR_INIT) && (((ADC_PWR_INIT) & (ADC_PWR_PD0_MASK | ADC_PWR_PD1_MASK | ADC_PWR_APD_MASK)) == 0UL))
while(((ADC->PWR) & (ADC_PWR_PSTS1_MASK | ADC_PWR_PSTS0_MASK)) != 0UL)
{}
#endif /* defined(ADC_PWR_INIT) && (((ADC_PWR_INIT) & (ADC_PWR_PD0_MASK | ADC_PWR_APD_MASK)) == 0UL) */
#endif /* ADC_PWR_INIT */
#if defined(ADC_CAL_INIT)
  ADC->CAL = ADC_CAL_INIT;
#endif /* ADC_CAL_INIT */
#if defined(ADC_PWR2_INIT)
  ADC->PWR2 = ADC_PWR2_INIT;
#endif /* ADC_PWR2_INIT */
#if defined(ADC_CTRL3_INIT)
  ADC->CTRL3 = ADC_CTRL3_INIT;
#endif /* ADC_CTRL3_INIT */
#if defined(ADC_ZXCTRL1_INIT)
  ADC->ZXCTRL1 = ADC_ZXCTRL1_INIT;
#endif /* ADC_ZXCTRL1_INIT */
#if defined(ADC_ZXCTRL2_INIT)
  ADC->ZXCTRL2 = ADC_ZXCTRL2_INIT;
#endif /* ADC_ZXCTRL2_INIT */
#if defined(ADC_ZXCTRL3_INIT)
  ADC->ZXCTRL3 = ADC_ZXCTRL3_INIT;
#endif /* ADC_ZXCTRL3_INIT */
#if defined(ADC_CLIST1_INIT)
  ADC->CLIST1 = ADC_CLIST1_INIT;
#endif /* ADC_CLIST1_INIT */
#if defined(ADC_CLIST2_INIT)
  ADC->CLIST2 = ADC_CLIST2_INIT;
#endif /* ADC_CLIST2_INIT */
#if defined(ADC_CLIST3_INIT)
  ADC->CLIST3 = ADC_CLIST3_INIT;
#endif /* ADC_CLIST3_INIT */
#if defined(ADC_CLIST4_INIT)
  ADC->CLIST4 = ADC_CLIST4_INIT;
#endif /* ADC_CLIST4_INIT */
#if defined(ADC_CLIST5_INIT)
  ADC->CLIST5 = ADC_CLIST5_INIT;
#endif /* ADC_CLIST5_INIT */
#if defined(ADC_SDIS_INIT)
  ADC->SDIS = ADC_SDIS_INIT;
#endif /* ADC_SDIS_INIT */
#if defined(ADC_SDIS2_INIT)
  ADC->SDIS2 = ADC_SDIS2_INIT;
#endif /* ADC_SDIS2_INIT */
#if defined(ADC_LOLIMSTAT_INIT)
  ADC->LOLIMSTAT = ADC_LOLIMSTAT_INIT;
#endif /* ADC_LOLIMSTAT_INIT */
#if defined(ADC_LOLIMSTAT2_INIT)
  ADC->LOLIMSTAT2 = ADC_LOLIMSTAT2_INIT;
#endif /* ADC_LOLIMSTAT2_INIT */
#if defined(ADC_HILIMSTAT_INIT)
  ADC->HILIMSTAT = ADC_HILIMSTAT_INIT;
#endif /* ADC_HILIMSTAT_INIT */
#if defined(ADC_HILIMSTAT2_INIT)
  ADC->HILIMSTAT2 = ADC_HILIMSTAT2_INIT;
#endif /* ADC_HILIMSTAT2_INIT */
#if defined(ADC_ZXSTAT_INIT)
  ADC->ZXSTAT = ADC_ZXSTAT_INIT;
#endif /* ADC_ZXSTAT_INIT */
#if defined(ADC_ZXSTAT2_INIT)
  ADC->ZXSTAT2 = ADC_ZXSTAT2_INIT;
#endif /* ADC_ZXSTAT2_INIT */
#if defined(ADC_GC1_INIT)
  ADC->GC1 = ADC_GC1_INIT;
#endif /* ADC_GC1_INIT */
#if defined(ADC_GC2_INIT)
  ADC->GC2 = ADC_GC2_INIT;
#endif /* ADC_GC2_INIT */
#if defined(ADC_GC3_INIT)
  ADC->GC3 = ADC_GC3_INIT;
#endif /* ADC_GC3_INIT */
#if defined(ADC_SCTRL_INIT)
  ADC->SCTRL = ADC_SCTRL_INIT;
#endif /* ADC_SCTRL_INIT */
#if defined(ADC_SCTRL2_INIT)
  ADC->SCTRL2 = ADC_SCTRL2_INIT;
#endif /* ADC_SCTRL2_INIT */
#if defined(ADC_SCHLTEN_INIT)
  ADC->SCHLTEN = ADC_SCHLTEN_INIT;
#endif /* ADC_SCHLTEN_INIT */
#if defined(ADC_SCHLTEN2_INIT)
  ADC->SCHLTEN2 = ADC_SCHLTEN2_INIT;
#endif /* ADC_SCHLTEN2_INIT */
#if defined(ADC_EXPCFG_INIT)
  ADC->EXPCFG = ADC_EXPCFG_INIT;
#endif /* ADC_EXPCFG_INIT */
#if defined(ADC_EXPAUX4A_INIT)
  ADC->EXPAUX4A = ADC_EXPAUX4A_INIT;
#endif /* ADC_EXPAUX4A_INIT */
#if defined(ADC_EXPAUX4B_INIT)
  ADC->EXPAUX4B = ADC_EXPAUX4B_INIT;
#endif /* ADC_EXPAUX4B_INIT */
#if defined(ADC_EXPMUX4A0_INIT)
  ADC->EXPMUX4A0 = ADC_EXPMUX4A0_INIT;
#endif /* ADC_EXPMUX4A0_INIT */
#if defined(ADC_EXPMUX4A1_INIT)
  ADC->EXPMUX4A1 = ADC_EXPMUX4A1_INIT;
#endif /* ADC_EXPMUX4A1_INIT */
#if defined(ADC_EXPMUX4B0_INIT)
  ADC->EXPMUX4B0 = ADC_EXPMUX4B0_INIT;
#endif /* ADC_EXPMUX4B0_INIT */
#if defined(ADC_EXPMUX4B1_INIT)
  ADC->EXPMUX4B1 = ADC_EXPMUX4B1_INIT;
#endif /* ADC_EXPMUX4B1_INIT */

#if defined(ADC_LOLIM0_INIT)
  ADC->LOLIM[0] = ADC_LOLIM0_INIT;
#endif /* ADC_LOLIM0_INIT */
#if defined(ADC_LOLIM20_INIT)
  ADC->LOLIM2[0 - ADC_MIN_REGS2_INDEX] = ADC_LOLIM20_INIT;
#endif /* ADC_LOLIM20_INIT */
#if defined(ADC_HILIM0_INIT)
  ADC->HILIM[0] = ADC_HILIM0_INIT;
#endif /* ADC_HILIM0_INIT */
#if defined(ADC_HILIM20_INIT)
  ADC->HILIM2[0 - ADC_MIN_REGS2_INDEX] = ADC_HILIM20_INIT;
#endif /* ADC_HILIM20_INIT */
#if defined(ADC_OFFST0_INIT)
  ADC->OFFST[0] = ADC_OFFST0_INIT;
#endif /* ADC_OFFST0_INIT */
#if defined (ADC_OFFST20_INIT)
  ADC->OFFST2[0 - ADC_MIN_REGS2_INDEX] = ADC_OFFST20_INIT;
#endif /* ADC_OFFST20_INIT */
#if defined(ADC_LOLIM1_INIT)
  ADC->LOLIM[1] = ADC_LOLIM1_INIT;
#endif /* ADC_LOLIM1_INIT */
#if defined(ADC_LOLIM21_INIT)
  ADC->LOLIM2[1 - ADC_MIN_REGS2_INDEX] = ADC_LOLIM21_INIT;
#endif /* ADC_LOLIM21_INIT */
#if defined(ADC_HILIM1_INIT)
  ADC->HILIM[1] = ADC_HILIM1_INIT;
#endif /* ADC_HILIM1_INIT */
#if defined(ADC_HILIM21_INIT)
  ADC->HILIM2[1 - ADC_MIN_REGS2_INDEX] = ADC_HILIM21_INIT;
#endif /* ADC_HILIM21_INIT */
#if defined(ADC_OFFST1_INIT)
  ADC->OFFST[1] = ADC_OFFST1_INIT;
#endif /* ADC_OFFST1_INIT */
#if defined (ADC_OFFST21_INIT)
  ADC->OFFST2[1 - ADC_MIN_REGS2_INDEX] = ADC_OFFST21_INIT;
#endif /* ADC_OFFST21_INIT */
#if defined(ADC_LOLIM2_INIT)
  ADC->LOLIM[2] = ADC_LOLIM2_INIT;
#endif /* ADC_LOLIM2_INIT */
#if defined(ADC_LOLIM22_INIT)
  ADC->LOLIM2[2 - ADC_MIN_REGS2_INDEX] = ADC_LOLIM22_INIT;
#endif /* ADC_LOLIM22_INIT */
#if defined(ADC_HILIM2_INIT)
  ADC->HILIM[2] = ADC_HILIM2_INIT;
#endif /* ADC_HILIM2_INIT */
#if defined(ADC_HILIM22_INIT)
  ADC->HILIM2[2 - ADC_MIN_REGS2_INDEX] = ADC_HILIM22_INIT;
#endif /* ADC_HILIM22_INIT */
#if defined(ADC_OFFST2_INIT)
  ADC->OFFST[2] = ADC_OFFST2_INIT;
#endif /* ADC_OFFST2_INIT */
#if defined (ADC_OFFST22_INIT)
  ADC->OFFST2[2 - ADC_MIN_REGS2_INDEX] = ADC_OFFST22_INIT;
#endif /* ADC_OFFST22_INIT */
#if defined(ADC_LOLIM3_INIT)
  ADC->LOLIM[3] = ADC_LOLIM3_INIT;
#endif /* ADC_LOLIM3_INIT */
#if defined(ADC_LOLIM23_INIT)
  ADC->LOLIM2[3 - ADC_MIN_REGS2_INDEX] = ADC_LOLIM23_INIT;
#endif /* ADC_LOLIM23_INIT */
#if defined(ADC_HILIM3_INIT)
  ADC->HILIM[3] = ADC_HILIM3_INIT;
#endif /* ADC_HILIM3_INIT */
#if defined(ADC_HILIM23_INIT)
  ADC->HILIM2[3 - ADC_MIN_REGS2_INDEX] = ADC_HILIM23_INIT;
#endif /* ADC_HILIM23_INIT */
#if defined(ADC_OFFST3_INIT)
  ADC->OFFST[3] = ADC_OFFST3_INIT;
#endif /* ADC_OFFST3_INIT */
#if defined (ADC_OFFST23_INIT)
  ADC->OFFST2[3 - ADC_MIN_REGS2_INDEX] = ADC_OFFST23_INIT;
#endif /* ADC_OFFST23_INIT */
#if defined(ADC_LOLIM4_INIT)
  ADC->LOLIM[4] = ADC_LOLIM4_INIT;
#endif /* ADC_LOLIM4_INIT */
#if defined(ADC_LOLIM24_INIT)
  ADC->LOLIM2[4 - ADC_MIN_REGS2_INDEX] = ADC_LOLIM24_INIT;
#endif /* ADC_LOLIM24_INIT */
#if defined(ADC_HILIM4_INIT)
  ADC->HILIM[4] = ADC_HILIM4_INIT;
#endif /* ADC_HILIM4_INIT */
#if defined(ADC_HILIM24_INIT)
  ADC->HILIM2[4 - ADC_MIN_REGS2_INDEX] = ADC_HILIM24_INIT;
#endif /* ADC_HILIM24_INIT */
#if defined(ADC_OFFST4_INIT)
  ADC->OFFST[4] = ADC_OFFST4_INIT;
#endif /* ADC_OFFST4_INIT */
#if defined (ADC_OFFST24_INIT)
  ADC->OFFST2[4 - ADC_MIN_REGS2_INDEX] = ADC_OFFST24_INIT;
#endif /* ADC_OFFST24_INIT */
#if defined(ADC_LOLIM5_INIT)
  ADC->LOLIM[5] = ADC_LOLIM5_INIT;
#endif /* ADC_LOLIM5_INIT */
#if defined(ADC_LOLIM25_INIT)
  ADC->LOLIM2[5 - ADC_MIN_REGS2_INDEX] = ADC_LOLIM25_INIT;
#endif /* ADC_LOLIM25_INIT */
#if defined(ADC_HILIM5_INIT)
  ADC->HILIM[5] = ADC_HILIM5_INIT;
#endif /* ADC_HILIM5_INIT */
#if defined(ADC_HILIM25_INIT)
  ADC->HILIM2[5 - ADC_MIN_REGS2_INDEX] = ADC_HILIM25_INIT;
#endif /* ADC_HILIM25_INIT */
#if defined(ADC_OFFST5_INIT)
  ADC->OFFST[5] = ADC_OFFST5_INIT;
#endif /* ADC_OFFST5_INIT */
#if defined (ADC_OFFST25_INIT)
  ADC->OFFST2[5 - ADC_MIN_REGS2_INDEX] = ADC_OFFST25_INIT;
#endif /* ADC_OFFST25_INIT */
#if defined(ADC_LOLIM6_INIT)
  ADC->LOLIM[6] = ADC_LOLIM6_INIT;
#endif /* ADC_LOLIM6_INIT */
#if defined(ADC_LOLIM26_INIT)
  ADC->LOLIM2[6 - ADC_MIN_REGS2_INDEX] = ADC_LOLIM26_INIT;
#endif /* ADC_LOLIM26_INIT */
#if defined(ADC_HILIM6_INIT)
  ADC->HILIM[6] = ADC_HILIM6_INIT;
#endif /* ADC_HILIM6_INIT */
#if defined(ADC_HILIM26_INIT)
  ADC->HILIM2[6 - ADC_MIN_REGS2_INDEX] = ADC_HILIM26_INIT;
#endif /* ADC_HILIM26_INIT */
#if defined(ADC_OFFST6_INIT)
  ADC->OFFST[6] = ADC_OFFST6_INIT;
#endif /* ADC_OFFST6_INIT */
#if defined (ADC_OFFST26_INIT)
  ADC->OFFST2[6 - ADC_MIN_REGS2_INDEX] = ADC_OFFST26_INIT;
#endif /* ADC_OFFST26_INIT */
#if defined(ADC_LOLIM7_INIT)
  ADC->LOLIM[7] = ADC_LOLIM7_INIT;
#endif /* ADC_LOLIM7_INIT */
#if defined(ADC_LOLIM27_INIT)
  ADC->LOLIM2[7 - ADC_MIN_REGS2_INDEX] = ADC_LOLIM27_INIT;
#endif /* ADC_LOLIM27_INIT */
#if defined(ADC_HILIM7_INIT)
  ADC->HILIM[7] = ADC_HILIM7_INIT;
#endif /* ADC_HILIM7_INIT */
#if defined(ADC_HILIM27_INIT)
  ADC->HILIM2[7 - ADC_MIN_REGS2_INDEX] = ADC_HILIM27_INIT;
#endif /* ADC_HILIM27_INIT */
#if defined(ADC_OFFST7_INIT)
  ADC->OFFST[7] = ADC_OFFST7_INIT;
#endif /* ADC_OFFST7_INIT */
#if defined (ADC_OFFST27_INIT)
  ADC->OFFST2[7 - ADC_MIN_REGS2_INDEX] = ADC_OFFST27_INIT;
#endif /* ADC_OFFST27_INIT */
#if defined(ADC_LOLIM16_INIT)
  ADC->LOLIM[16] = ADC_LOLIM16_INIT;
#endif /* ADC_LOLIM16_INIT */
#if defined(ADC_LOLIM216_INIT)
  ADC->LOLIM2[16 - ADC_MIN_REGS2_INDEX] = ADC_LOLIM216_INIT;
#endif /* ADC_LOLIM216_INIT */
#if defined(ADC_HILIM16_INIT)
  ADC->HILIM[16] = ADC_HILIM16_INIT;
#endif /* ADC_HILIM16_INIT */
#if defined(ADC_HILIM216_INIT)
  ADC->HILIM2[16 - ADC_MIN_REGS2_INDEX] = ADC_HILIM216_INIT;
#endif /* ADC_HILIM216_INIT */
#if defined(ADC_OFFST16_INIT)
  ADC->OFFST[16] = ADC_OFFST16_INIT;
#endif /* ADC_OFFST16_INIT */
#if defined (ADC_OFFST216_INIT)
  ADC->OFFST2[16 - ADC_MIN_REGS2_INDEX] = ADC_OFFST216_INIT;
#endif /* ADC_OFFST216_INIT */
#if defined(ADC_LOLIM17_INIT)
  ADC->LOLIM[17] = ADC_LOLIM17_INIT;
#endif /* ADC_LOLIM17_INIT */
#if defined(ADC_LOLIM217_INIT)
  ADC->LOLIM2[17 - ADC_MIN_REGS2_INDEX] = ADC_LOLIM217_INIT;
#endif /* ADC_LOLIM217_INIT */
#if defined(ADC_HILIM17_INIT)
  ADC->HILIM[17] = ADC_HILIM17_INIT;
#endif /* ADC_HILIM17_INIT */
#if defined(ADC_HILIM217_INIT)
  ADC->HILIM2[17 - ADC_MIN_REGS2_INDEX] = ADC_HILIM217_INIT;
#endif /* ADC_HILIM217_INIT */
#if defined(ADC_OFFST17_INIT)
  ADC->OFFST[17] = ADC_OFFST17_INIT;
#endif /* ADC_OFFST17_INIT */
#if defined (ADC_OFFST217_INIT)
  ADC->OFFST2[17 - ADC_MIN_REGS2_INDEX] = ADC_OFFST217_INIT;
#endif /* ADC_OFFST217_INIT */
#if defined(ADC_LOLIM8_INIT)
  ADC->LOLIM[8] = ADC_LOLIM8_INIT;
#endif /* ADC_LOLIM8_INIT */
#if defined(ADC_LOLIM28_INIT)
  ADC->LOLIM2[8 - ADC_MIN_REGS2_INDEX] = ADC_LOLIM28_INIT;
#endif /* ADC_LOLIM28_INIT */
#if defined(ADC_HILIM8_INIT)
  ADC->HILIM[8] = ADC_HILIM8_INIT;
#endif /* ADC_HILIM8_INIT */
#if defined(ADC_HILIM28_INIT)
  ADC->HILIM2[8 - ADC_MIN_REGS2_INDEX] = ADC_HILIM28_INIT;
#endif /* ADC_HILIM28_INIT */
#if defined(ADC_OFFST8_INIT)
  ADC->OFFST[8] = ADC_OFFST8_INIT;
#endif /* ADC_OFFST8_INIT */
#if defined (ADC_OFFST28_INIT)
  ADC->OFFST2[8 - ADC_MIN_REGS2_INDEX] = ADC_OFFST28_INIT;
#endif /* ADC_OFFST28_INIT */
#if defined(ADC_LOLIM9_INIT)
  ADC->LOLIM[9] = ADC_LOLIM9_INIT;
#endif /* ADC_LOLIM9_INIT */
#if defined(ADC_LOLIM29_INIT)
  ADC->LOLIM2[9 - ADC_MIN_REGS2_INDEX] = ADC_LOLIM29_INIT;
#endif /* ADC_LOLIM29_INIT */
#if defined(ADC_HILIM9_INIT)
  ADC->HILIM[9] = ADC_HILIM9_INIT;
#endif /* ADC_HILIM9_INIT */
#if defined(ADC_HILIM29_INIT)
  ADC->HILIM2[9 - ADC_MIN_REGS2_INDEX] = ADC_HILIM29_INIT;
#endif /* ADC_HILIM29_INIT */
#if defined(ADC_OFFST9_INIT)
  ADC->OFFST[9] = ADC_OFFST9_INIT;
#endif /* ADC_OFFST9_INIT */
#if defined (ADC_OFFST29_INIT)
  ADC->OFFST2[9 - ADC_MIN_REGS2_INDEX] = ADC_OFFST29_INIT;
#endif /* ADC_OFFST29_INIT */
#if defined(ADC_LOLIM10_INIT)
  ADC->LOLIM[10] = ADC_LOLIM10_INIT;
#endif /* ADC_LOLIM10_INIT */
#if defined(ADC_LOLIM210_INIT)
  ADC->LOLIM2[10 - ADC_MIN_REGS2_INDEX] = ADC_LOLIM210_INIT;
#endif /* ADC_LOLIM210_INIT */
#if defined(ADC_HILIM10_INIT)
  ADC->HILIM[10] = ADC_HILIM10_INIT;
#endif /* ADC_HILIM10_INIT */
#if defined(ADC_HILIM210_INIT)
  ADC->HILIM2[10 - ADC_MIN_REGS2_INDEX] = ADC_HILIM210_INIT;
#endif /* ADC_HILIM210_INIT */
#if defined(ADC_OFFST10_INIT)
  ADC->OFFST[10] = ADC_OFFST10_INIT;
#endif /* ADC_OFFST10_INIT */
#if defined (ADC_OFFST210_INIT)
  ADC->OFFST2[10 - ADC_MIN_REGS2_INDEX] = ADC_OFFST210_INIT;
#endif /* ADC_OFFST210_INIT */
#if defined(ADC_LOLIM11_INIT)
  ADC->LOLIM[11] = ADC_LOLIM11_INIT;
#endif /* ADC_LOLIM11_INIT */
#if defined(ADC_LOLIM211_INIT)
  ADC->LOLIM2[11 - ADC_MIN_REGS2_INDEX] = ADC_LOLIM211_INIT;
#endif /* ADC_LOLIM211_INIT */
#if defined(ADC_HILIM11_INIT)
  ADC->HILIM[11] = ADC_HILIM11_INIT;
#endif /* ADC_HILIM11_INIT */
#if defined(ADC_HILIM211_INIT)
  ADC->HILIM2[11 - ADC_MIN_REGS2_INDEX] = ADC_HILIM211_INIT;
#endif /* ADC_HILIM211_INIT */
#if defined(ADC_OFFST11_INIT)
  ADC->OFFST[11] = ADC_OFFST11_INIT;
#endif /* ADC_OFFST11_INIT */
#if defined (ADC_OFFST211_INIT)
  ADC->OFFST2[11 - ADC_MIN_REGS2_INDEX] = ADC_OFFST211_INIT;
#endif /* ADC_OFFST211_INIT */
#if defined(ADC_LOLIM12_INIT)
  ADC->LOLIM[12] = ADC_LOLIM12_INIT;
#endif /* ADC_LOLIM12_INIT */
#if defined(ADC_LOLIM212_INIT)
  ADC->LOLIM2[12 - ADC_MIN_REGS2_INDEX] = ADC_LOLIM212_INIT;
#endif /* ADC_LOLIM212_INIT */
#if defined(ADC_HILIM12_INIT)
  ADC->HILIM[12] = ADC_HILIM12_INIT;
#endif /* ADC_HILIM12_INIT */
#if defined(ADC_HILIM212_INIT)
  ADC->HILIM2[12 - ADC_MIN_REGS2_INDEX] = ADC_HILIM212_INIT;
#endif /* ADC_HILIM212_INIT */
#if defined(ADC_OFFST12_INIT)
  ADC->OFFST[12] = ADC_OFFST12_INIT;
#endif /* ADC_OFFST12_INIT */
#if defined (ADC_OFFST212_INIT)
  ADC->OFFST2[12 - ADC_MIN_REGS2_INDEX] = ADC_OFFST212_INIT;
#endif /* ADC_OFFST212_INIT */
#if defined(ADC_LOLIM13_INIT)
  ADC->LOLIM[13] = ADC_LOLIM13_INIT;
#endif /* ADC_LOLIM13_INIT */
#if defined(ADC_LOLIM213_INIT)
  ADC->LOLIM2[13 - ADC_MIN_REGS2_INDEX] = ADC_LOLIM213_INIT;
#endif /* ADC_LOLIM213_INIT */
#if defined(ADC_HILIM13_INIT)
  ADC->HILIM[13] = ADC_HILIM13_INIT;
#endif /* ADC_HILIM13_INIT */
#if defined(ADC_HILIM213_INIT)
  ADC->HILIM2[13 - ADC_MIN_REGS2_INDEX] = ADC_HILIM213_INIT;
#endif /* ADC_HILIM213_INIT */
#if defined(ADC_OFFST13_INIT)
  ADC->OFFST[13] = ADC_OFFST13_INIT;
#endif /* ADC_OFFST13_INIT */
#if defined (ADC_OFFST213_INIT)
  ADC->OFFST2[13 - ADC_MIN_REGS2_INDEX] = ADC_OFFST213_INIT;
#endif /* ADC_OFFST213_INIT */
#if defined(ADC_LOLIM14_INIT)
  ADC->LOLIM[14] = ADC_LOLIM14_INIT;
#endif /* ADC_LOLIM14_INIT */
#if defined(ADC_LOLIM214_INIT)
  ADC->LOLIM2[14 - ADC_MIN_REGS2_INDEX] = ADC_LOLIM214_INIT;
#endif /* ADC_LOLIM214_INIT */
#if defined(ADC_HILIM14_INIT)
  ADC->HILIM[14] = ADC_HILIM14_INIT;
#endif /* ADC_HILIM14_INIT */
#if defined(ADC_HILIM214_INIT)
  ADC->HILIM2[14 - ADC_MIN_REGS2_INDEX] = ADC_HILIM214_INIT;
#endif /* ADC_HILIM214_INIT */
#if defined(ADC_OFFST14_INIT)
  ADC->OFFST[14] = ADC_OFFST14_INIT;
#endif /* ADC_OFFST14_INIT */
#if defined (ADC_OFFST214_INIT)
  ADC->OFFST2[14 - ADC_MIN_REGS2_INDEX] = ADC_OFFST214_INIT;
#endif /* ADC_OFFST214_INIT */
#if defined(ADC_LOLIM15_INIT)
  ADC->LOLIM[15] = ADC_LOLIM15_INIT;
#endif /* ADC_LOLIM15_INIT */
#if defined(ADC_LOLIM215_INIT)
  ADC->LOLIM2[15 - ADC_MIN_REGS2_INDEX] = ADC_LOLIM215_INIT;
#endif /* ADC_LOLIM215_INIT */
#if defined(ADC_HILIM15_INIT)
  ADC->HILIM[15] = ADC_HILIM15_INIT;
#endif /* ADC_HILIM15_INIT */
#if defined(ADC_HILIM215_INIT)
  ADC->HILIM2[15 - ADC_MIN_REGS2_INDEX] = ADC_HILIM215_INIT;
#endif /* ADC_HILIM215_INIT */
#if defined(ADC_OFFST15_INIT)
  ADC->OFFST[15] = ADC_OFFST15_INIT;
#endif /* ADC_OFFST15_INIT */
#if defined (ADC_OFFST215_INIT)
  ADC->OFFST2[15 - ADC_MIN_REGS2_INDEX] = ADC_OFFST215_INIT;
#endif /* ADC_OFFST215_INIT */
#if defined(ADC_LOLIM18_INIT)
  ADC->LOLIM[18] = ADC_LOLIM18_INIT;
#endif /* ADC_LOLIM18_INIT */
#if defined(ADC_LOLIM218_INIT)
  ADC->LOLIM2[18 - ADC_MIN_REGS2_INDEX] = ADC_LOLIM218_INIT;
#endif /* ADC_LOLIM218_INIT */
#if defined(ADC_HILIM18_INIT)
  ADC->HILIM[18] = ADC_HILIM18_INIT;
#endif /* ADC_HILIM18_INIT */
#if defined(ADC_HILIM218_INIT)
  ADC->HILIM2[18 - ADC_MIN_REGS2_INDEX] = ADC_HILIM218_INIT;
#endif /* ADC_HILIM218_INIT */
#if defined(ADC_OFFST18_INIT)
  ADC->OFFST[18] = ADC_OFFST18_INIT;
#endif /* ADC_OFFST18_INIT */
#if defined (ADC_OFFST218_INIT)
  ADC->OFFST2[18 - ADC_MIN_REGS2_INDEX] = ADC_OFFST218_INIT;
#endif /* ADC_OFFST218_INIT */
#if defined(ADC_LOLIM19_INIT)
  ADC->LOLIM[19] = ADC_LOLIM19_INIT;
#endif /* ADC_LOLIM19_INIT */
#if defined(ADC_LOLIM219_INIT)
  ADC->LOLIM2[19 - ADC_MIN_REGS2_INDEX] = ADC_LOLIM219_INIT;
#endif /* ADC_LOLIM219_INIT */
#if defined(ADC_HILIM19_INIT)
  ADC->HILIM[19] = ADC_HILIM19_INIT;
#endif /* ADC_HILIM19_INIT */
#if defined(ADC_HILIM219_INIT)
  ADC->HILIM2[19 - ADC_MIN_REGS2_INDEX] = ADC_HILIM219_INIT;
#endif /* ADC_HILIM219_INIT */
#if defined(ADC_OFFST19_INIT)
  ADC->OFFST[19] = ADC_OFFST19_INIT;
#endif /* ADC_OFFST19_INIT */
#if defined (ADC_OFFST219_INIT)
  ADC->OFFST2[19 - ADC_MIN_REGS2_INDEX] = ADC_OFFST219_INIT;
#endif /* ADC_OFFST219_INIT */
}

