nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f83000evk/demo_apps/mc_pmsm/pmsm_enc/peripherals.c
/***********************************************************************************************************************
 * CMPC initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'CMPC'
- type: 'cmp_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'cmp_reg_3fe3364eca8ece52bd212873a03681c2'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'CMPC'
- config_sets:
  - fsl_filter:
    - filter_config:
      - clockSource: 'SystemClock'
      - clockSourceFreq: 'BOARD_BootClockRUN'
      - filterPeriod: '1'
      - filterCount2: '1'
  - fsl_cmp:
    - main_config:
      - explicitEnableCmp: 'true'
      - filterModes: 'm0'
      - hysteresisMode: 'kCMP_HysteresisLevel0'
      - enableHighSpeed: 'true'
      - enableInvertOutput: 'false'
      - useUnfilteredOutput: 'false'
      - enablePinOut: 'false'
    - positiveChannel: 'IN.3'
    - negativeChannel: 'IN.7'
  - fsl_dac:
    - enableDAC: 'true'
    - dac_config:
      - referenceVoltageSource: 'DAC_8bit_VIN1'
      - DACValue: '192'
  - interrupt:
    - interrupt_sel: ''
    - enableDma: 'false'
    - enable_irq: 'false'
    - interrupt:
      - IRQn: 'kCMPA_VECTORn'
      - dsc_enable_interrrupt: 'iprVal0'
      - enable_custom_name: 'false'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void CMPC_init(void) {
  /* Software reset the CMPC. */
  CMPC->CR0   = 0U;
  CMPC->CR1   = 0U;
  CMPC->FPR   = 0U;
  CMPC->SCR   = 0U;
  CMPC->DACCR = 0U;
  CMPC->MUXCR = 0U;
#if defined(CMPC_CR0_INIT)
  CMPC->CR0 = CMPC_CR0_INIT;
#endif /* CMPC_CR0_INIT */
#if defined(CMPC_FPR_INIT)
  CMPC->FPR = CMPC_FPR_INIT;
#endif /* CMPC_FPR_INIT */
#if defined(CMPC_SCR_INIT)
  CMPC->SCR = CMPC_SCR_INIT;
#endif /* CMPC_SCR_INIT */
#if defined(CMPC_DACCR_INIT)
  CMPC->DACCR = CMPC_DACCR_INIT;
#endif /* CMPC_DACCR_INIT */
#if defined(CMPC_MUXCR_INIT)
  CMPC->MUXCR = CMPC_MUXCR_INIT;
#endif /* CMPC_MUXCR_INIT */
#if defined(CMPC_CR1_INIT)
  CMPC->CR1 = CMPC_CR1_INIT;
#endif /* CMPC_CR1_INIT */
}

/***********************************************************************************************************************
 * Flash_configuration initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'Flash_configuration'
- type: 'dsc_flash_config'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'dsc_flash_config_87b8cda2db02ccd1732cf954ffb02af3'
- functional_group: 'BOARD_InitPeripherals'
- config_sets:
  - fcf_config:
    - bcaConfig:
      - crcCheck:
        - crcStartAddress: '0xFFFFFFFF'
        - crcByteCount: '0xFFFFFFFF'
        - crcExpectedValue: '0xFFFFFFFF'
      - enabledPeripherals: 'uart i2c spi can'
      - i2cSlaveAddress: '0xFF'
      - peripheralDetectionTimeout: '6000'
      - directBootFlag: 'false'
      - canConfig:
        - baudRateConfig: 'auto'
        - canTxId: '0xFFFF'
        - canRxId: '0xFFFF'
    - flashConfig:
      - keyBytes:
        - 0:
          - byteValue: '0xFF'
        - 1:
          - byteValue: '0xFF'
        - 2:
          - byteValue: '0xFF'
        - 3:
          - byteValue: '0xFF'
        - 4:
          - byteValue: '0xFF'
        - 5:
          - byteValue: '0xFF'
        - 6:
          - byteValue: '0xFF'
        - 7:
          - byteValue: '0xFF'
      - protBytes:
        - 0:
          - byteValue: '0xFF'
        - 1:
          - byteValue: '0xFF'
        - 2:
          - byteValue: '0xFF'
        - 3:
          - byteValue: '0xFF'
      - FSEC:
        - SEC: 'unsecure'
        - FSLACC: 'granted'
        - KEYEN: 'false'
        - MEEN: 'true'
      - bootOption: '0'
      - pwrMode: '1'
    - fcf_codegenerator: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

/* Empty initialization function (commented out)
static void Flash_configuration_init(void) {
} */

/***********************************************************************************************************************
 * INTC initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'INTC'
- type: 'intc_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'intc_reg_5d361a53fef6bec91d1f7c2aeedd895b'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'INTC'
- config_sets:
  - intc:
    - dsc_core_int_level: 'mask_level_0_1_2'
    - interrupt_table:
      - 0: []
      - 1: []
      - 2: []
    - interrupts:
      - 0:
        - channelId: 'GPIOF_INT_VECT'
        - interrupt_t:
          - IRQn: 'kGPIOF_VECTORn'
          - dsc_enable_interrrupt: 'iprVal1'
          - enable_custom_name: 'false'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

/* Empty initialization function (commented out)
static void INTC_init(void) {
} */

/***********************************************************************************************************************
 * PIT0 initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'PIT0'
- type: 'pit_reg'
- mode: 'PIT_GENERAL'
- custom_name_enabled: 'false'
- type_id: 'pit_reg_6035bba38bcf2931406cb9b038081d5d'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'PIT0'
- config_sets:
  - pit_reg:
    - clock_config:
      - clockSource: 'kAltClock0'
      - clockSourceFreq: 'BOARD_BootClockRUN'
      - prescaler: 'p9'
      - modulo: '195'
    - slaveMode: 'false'
    - enableCounter: 'true'
    - enableRollOverInterruptSource: 'true'
    - enable_irq: 'true'
    - interrupt:
      - IRQn: 'kPIT0_ROLLOVR_VECTORn'
      - dsc_enable_interrrupt: 'iprVal2'
      - enable_custom_name: 'false'
    - pit_template_params: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void PIT0_init(void) {
/****************************************************************************/
/* PIT0 initialization */
/****************************************************************************/
    /* Software reset PIT0. */
    SIM->PSWR2 |= SIM_PSWR2_PIT0_MASK;
    SIM->PSWR2 &= ~ SIM_PSWR2_PIT0_MASK;

