nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f83000evk/demo_apps/mc_pmsm/pmsm_enc/peripherals.c
#ifdef PWM_CAPTFILTA_CAPTA_FILT_PER_MASK
  PWMA->SM[1].CAPTFILTA = 0x0U;
#ifdef PWMA_SM1CAPTFILTA_INIT
  PWMA->SM[1].CAPTFILTA = PWMA_SM1CAPTFILTA_INIT;
#endif
#endif  /* PWM_CAPTFILTA_CAPTA_FILT_PER_MASK */

#ifdef PWM_CAPTCTRLB_EDGB0_MASK
#ifdef PWMA_SM1CAPTCTRLB_INIT
  PWMA->SM[1].CAPTCTRLB = PWMA_SM1CAPTCTRLB_INIT;
#else
  PWMA->SM[1].CAPTCTRLB = 0x0U;
#endif /* PWMA_SM1CAPTCTRLB_INIT */
#ifdef PWMA_SM1CAPTCOMPB_INIT
  PWMA->SM[1].CAPTCOMPB = PWMA_SM1CAPTCOMPB_INIT;
#else
  PWMA->SM[1].CAPTCOMPB = 0x0U;
#endif /* PWMA_SM1CAPTCOMPB_INIT */
#endif /* PWM_CAPTCTRLB_EDGB0_MASK */

#ifdef PWM_CAPTFILTB_CAPTB_FILT_PER_MASK
  PWMA->SM[1].CAPTFILTB = 0x0U;
#ifdef PWMA_SM1CAPTFILTB_INIT
  PWMA->SM[1].CAPTFILTB = PWMA_SM1CAPTFILTB_INIT;
#endif
#endif  /* PWM_CAPTFILTB_CAPTB_FILT_PER_MASK */

#ifdef PWM_CAPTCTRLX_EDGX0_MASK
#ifdef PWMA_SM1CAPTCTRLX_INIT
  PWMA->SM[1].CAPTCTRLX = PWMA_SM1CAPTCTRLX_INIT;
#else
  PWMA->SM[1].CAPTCTRLX = 0x0U;
#endif /* PWMA_SM1CAPTCTRLX_INIT */
#ifdef PWMA_SM1CAPTCOMPX_INIT
  PWMA->SM[1].CAPTCOMPX = PWMA_SM1CAPTCOMPX_INIT;
#else
  PWMA->SM[1].CAPTCOMPX = 0x0U;
#endif /* PWMA_SM1CAPTCOMPX_INIT */
#endif /* PWM_CAPTCTRLX_EDGX0_MASK */

#ifdef PWM_CAPTFILTX_CAPTX_FILT_PER_MASK
  PWMA->SM[1].CAPTFILTX = 0x0U;
#ifdef PWMA_SM1CAPTFILTX_INIT
  PWMA->SM[1].CAPTFILTX = PWMA_SM1CAPTFILTX_INIT;
#endif
#endif  /* PWM_CAPTFILTX_CAPTX_FILT_PER_MASK */

#if (0 != 1)
#ifdef PWM_PHASEDLY_PHASEDLY_MASK
#ifdef PWMA_SM1PHASEDLY_INIT
  PWMA->SM[1].PHASEDLY = PWMA_SM1PHASEDLY_INIT;
#else
  PWMA->SM[1].PHASEDLY = 0x0U;
#endif /* PWMA_SM1PHASEDLY_INIT */
#endif /* PWM_PHASEDLY_PHASEDLY_MASK */
#endif /* (0 != 1) */
#if ((!defined(PWMA_SM1CTRL_INIT)) || (0U == (PWMA_SM1CTRL_INIT & PWM_CTRL_LDMOD_MASK)))
  PWMA->MCTRL |= PWM_MCTRL_LDOK(1U << 1);
#endif /* ((!defined(PWMA_SM1CTRL_INIT)) || (0U == (PWMA_SM1CTRL_INIT & PWM_CTRL_LDMOD_MASK))) */

/****************************************************************************/
/* Submodule 2 initialization */
/****************************************************************************/
  /* Disable the submodule and its output before the submodule init. */
  PWMA->OUTEN &= ~(PWM_OUTEN_PWMA_EN(1U << 2) | PWM_OUTEN_PWMB_EN(1U << 2) | PWM_OUTEN_PWMX_EN(1U << 2));
  PWMA->MCTRL &= ~(PWM_MCTRL_RUN(1U << 2) | PWM_MCTRL_CLDOK(1U << 2));
#ifdef PWMA_SM2CTRL_INIT
  PWMA->SM[2].CTRL = PWMA_SM2CTRL_INIT;
#else
  PWMA->SM[2].CTRL = 0x400U;
#endif /* PWMA_SM2CTRL_INIT */
#ifdef PWMA_SM2CTRL2_INIT
  PWMA->SM[2].CTRL2 = PWMA_SM2CTRL2_INIT;
#else
  PWMA->SM[2].CTRL2 = 0x0U;
#endif /* PWMA_SM2CTRL2_INIT */
#ifdef PWMA_SM2INIT_INIT
  PWMA->SM[2].INIT = PWMA_SM2INIT_INIT;
#else
  PWMA->SM[2].INIT = 0x0U;
#endif /* PWMA_SM2INIT_INIT */
#ifdef PWMA_SM2VAL0_INIT
  PWMA->SM[2].VAL0 = PWMA_SM2VAL0_INIT;
#else
  PWMA->SM[2].VAL0 = 0x0U;
#endif /* PWMA_SM2VAL0_INIT */
#ifdef PWMA_SM2VAL1_INIT
  PWMA->SM[2].VAL1 = PWMA_SM2VAL1_INIT;
#else
  PWMA->SM[2].VAL1 = 0x0U;
#endif /* PWMA_SM2VAL1_INIT */
#ifdef PWMA_SM2VAL2_INIT
  PWMA->SM[2].VAL2 = PWMA_SM2VAL2_INIT;
#else
  PWMA->SM[2].VAL2 = 0x0U;
#endif /* PWMA_SM2VAL2_INIT */
#ifdef PWMA_SM2VAL3_INIT
  PWMA->SM[2].VAL3 = PWMA_SM2VAL3_INIT;
#else
  PWMA->SM[2].VAL3 = 0x0U;
#endif /* PWMA_SM2VAL3_INIT */
#ifdef PWMA_SM2VAL4_INIT
  PWMA->SM[2].VAL4 = PWMA_SM2VAL4_INIT;
#else
  PWMA->SM[2].VAL4 = 0x0U;
#endif /* PWMA_SM2VAL4_INIT */
#ifdef PWMA_SM2VAL5_INIT
  PWMA->SM[2].VAL5 = PWMA_SM2VAL5_INIT;
#else
  PWMA->SM[2].VAL5 = 0x0U;
#endif /* PWMA_SM2VAL5_INIT */
#if (defined(PWMA_SM2_FRACTIONAL_BLOCK_AVAILABLE))
#ifdef PWMA_SM2FRACVAL1_INIT
  PWMA->SM[2].FRACVAL1 = PWMA_SM2FRACVAL1_INIT;
#else
  PWMA->SM[2].FRACVAL1 = 0x0U;
#endif /* PWMA_SM2FRACVAL1_INIT */
#ifdef PWMA_SM2FRACVAL2_INIT
  PWMA->SM[2].FRACVAL2 = PWMA_SM2FRACVAL2_INIT;
#else
  PWMA->SM[2].FRACVAL2 = 0x0U;
#endif /* PWMA_SM2FRACVAL2_INIT */
#ifdef PWMA_SM2FRACVAL3_INIT
  PWMA->SM[2].FRACVAL3 = PWMA_SM2FRACVAL3_INIT;
#else
  PWMA->SM[2].FRACVAL3 = 0x0U;
#endif /* PWMA_SM2FRACVAL3_INIT */
#ifdef PWMA_SM2FRACVAL4_INIT
  PWMA->SM[2].FRACVAL4 = PWMA_SM2FRACVAL4_INIT;
#else
  PWMA->SM[2].FRACVAL4 = 0x0U;
#endif /* PWMA_SM2FRACVAL4_INIT */
#ifdef PWMA_SM2FRACVAL5_INIT
  PWMA->SM[2].FRACVAL5 = PWMA_SM2FRACVAL5_INIT;
#else
  PWMA->SM[2].FRACVAL5 = 0x0U;
#endif /* PWMA_SM2FRACVAL5_INIT */
#ifdef PWMA_SM2FRCTRL_INIT
  PWMA->SM[2].FRCTRL = PWMA_SM2FRCTRL_INIT;
#else
  PWMA->SM[2].FRCTRL = 0x0U;
#endif /* PWMA_SM2FRCTRL_INIT */
#endif /* (defined(PWMA_SM2_FRACTIONAL_BLOCK_AVAILABLE)) */
#ifdef PWMA_SM2OCTRL_INIT
  PWMA->SM[2].OCTRL = PWMA_SM2OCTRL_INIT;
#else
  PWMA->SM[2].OCTRL = 0x0U;
#endif /* PWMA_SM2OCTRL_INIT */
#ifdef PWMA_SM2STS_INIT
  PWMA->SM[2].STS = PWMA_SM2STS_INIT;
#else
  PWMA->SM[2].STS = 0x3fffU;
#endif /* PWMA_SM2STS_INIT */
#ifdef PWMA_SM2INTEN_INIT
  PWMA->SM[2].INTEN = PWMA_SM2INTEN_INIT;
#else
  PWMA->SM[2].INTEN = 0x0U;
#endif /* PWMA_SM2INTEN_INIT */
#ifdef PWMA_SM2DMAEN_INIT
  PWMA->SM[2].DMAEN = PWMA_SM2DMAEN_INIT;
#else
  PWMA->SM[2].DMAEN = 0x0U;
#endif /* PWMA_SM2DMAEN_INIT */
#ifdef PWMA_SM2TCTRL_INIT
  PWMA->SM[2].TCTRL = PWMA_SM2TCTRL_INIT;
#else
  PWMA->SM[2].TCTRL = 0x0U;
#endif /* PWMA_SM2TCTRL_INIT */
#ifdef PWMA_SM2DISMAP0_INIT
  PWMA->SM[2].DISMAP[0] = PWMA_SM2DISMAP0_INIT;
#else
  PWMA->SM[2].DISMAP[0] = 0xffffU;
#endif /* PWMA_SM2DISMAP0_INIT */
#ifdef PWMA_SM2DISMAP1_INIT
  PWMA->SM[2].DISMAP[1] = PWMA_SM2DISMAP1_INIT;
#else
  PWMA->SM[2].DISMAP[1] = 0xffffU;
#endif /* PWMA_SM2DISMAP1_INIT */
#ifdef PWMA_SM2DTCNT0_INIT
  PWMA->SM[2].DTCNT0 = PWMA_SM2DTCNT0_INIT;
#else
  PWMA->SM[2].DTCNT0 = 0x7ffU;
#endif /* PWMA_SM2DTCNT0_INIT */
#ifdef PWMA_SM2DTCNT1_INIT
  PWMA->SM[2].DTCNT1 = PWMA_SM2DTCNT1_INIT;
#else
  PWMA->SM[2].DTCNT1 = 0x7ffU;
#endif /* PWMA_SM2DTCNT1_INIT */

#ifdef PWM_CAPTCTRLA_EDGA0_MASK
#ifdef PWMA_SM2CAPTCTRLA_INIT
  PWMA->SM[2].CAPTCTRLA = PWMA_SM2CAPTCTRLA_INIT;
#else
  PWMA->SM[2].CAPTCTRLA = 0x0U;
#endif /* PWMA_SM2CAPTCTRLA_INIT */
#ifdef PWMA_SM2CAPTCOMPA_INIT
  PWMA->SM[2].CAPTCOMPA = PWMA_SM2CAPTCOMPA_INIT;
#else
  PWMA->SM[2].CAPTCOMPA = 0x0U;
#endif /* PWMA_SM2CAPTCOMPA_INIT */
#endif /* PWM_CAPTCTRLA_EDGA0_MASK */

