nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f83000evk/demo_apps/mc_pmsm/pmsm_enc/peripherals.c
#ifdef PWM_CAPTFILTA_CAPTA_FILT_PER_MASK
  PWMA->SM[0].CAPTFILTA = 0x0U;
#ifdef PWMA_SM0CAPTFILTA_INIT
  PWMA->SM[0].CAPTFILTA = PWMA_SM0CAPTFILTA_INIT;
#endif
#endif  /* PWM_CAPTFILTA_CAPTA_FILT_PER_MASK */

#ifdef PWM_CAPTCTRLB_EDGB0_MASK
#ifdef PWMA_SM0CAPTCTRLB_INIT
  PWMA->SM[0].CAPTCTRLB = PWMA_SM0CAPTCTRLB_INIT;
#else
  PWMA->SM[0].CAPTCTRLB = 0x0U;
#endif /* PWMA_SM0CAPTCTRLB_INIT */
#ifdef PWMA_SM0CAPTCOMPB_INIT
  PWMA->SM[0].CAPTCOMPB = PWMA_SM0CAPTCOMPB_INIT;
#else
  PWMA->SM[0].CAPTCOMPB = 0x0U;
#endif /* PWMA_SM0CAPTCOMPB_INIT */
#endif /* PWM_CAPTCTRLB_EDGB0_MASK */

#ifdef PWM_CAPTFILTB_CAPTB_FILT_PER_MASK
  PWMA->SM[0].CAPTFILTB = 0x0U;
#ifdef PWMA_SM0CAPTFILTB_INIT
  PWMA->SM[0].CAPTFILTB = PWMA_SM0CAPTFILTB_INIT;
#endif
#endif  /* PWM_CAPTFILTB_CAPTB_FILT_PER_MASK */

#ifdef PWM_CAPTCTRLX_EDGX0_MASK
#ifdef PWMA_SM0CAPTCTRLX_INIT
  PWMA->SM[0].CAPTCTRLX = PWMA_SM0CAPTCTRLX_INIT;
#else
  PWMA->SM[0].CAPTCTRLX = 0x0U;
#endif /* PWMA_SM0CAPTCTRLX_INIT */
#ifdef PWMA_SM0CAPTCOMPX_INIT
  PWMA->SM[0].CAPTCOMPX = PWMA_SM0CAPTCOMPX_INIT;
#else
  PWMA->SM[0].CAPTCOMPX = 0x0U;
#endif /* PWMA_SM0CAPTCOMPX_INIT */
#endif /* PWM_CAPTCTRLX_EDGX0_MASK */

#ifdef PWM_CAPTFILTX_CAPTX_FILT_PER_MASK
  PWMA->SM[0].CAPTFILTX = 0x0U;
#ifdef PWMA_SM0CAPTFILTX_INIT
  PWMA->SM[0].CAPTFILTX = PWMA_SM0CAPTFILTX_INIT;
#endif
#endif  /* PWM_CAPTFILTX_CAPTX_FILT_PER_MASK */

#if (0 != 0)
#ifdef PWM_PHASEDLY_PHASEDLY_MASK
#ifdef PWMA_SM0PHASEDLY_INIT
  PWMA->SM[0].PHASEDLY = PWMA_SM0PHASEDLY_INIT;
#else
  PWMA->SM[0].PHASEDLY = 0x0U;
#endif /* PWMA_SM0PHASEDLY_INIT */
#endif /* PWM_PHASEDLY_PHASEDLY_MASK */
#endif /* (0 != 0) */
#if ((!defined(PWMA_SM0CTRL_INIT)) || (0U == (PWMA_SM0CTRL_INIT & PWM_CTRL_LDMOD_MASK)))
  PWMA->MCTRL |= PWM_MCTRL_LDOK(1U << 0);
#endif /* ((!defined(PWMA_SM0CTRL_INIT)) || (0U == (PWMA_SM0CTRL_INIT & PWM_CTRL_LDMOD_MASK))) */

/****************************************************************************/
/* Fault channel0 initialization */
/****************************************************************************/
  /* Fault setting are shared for all submodules, it is allowed to initiate it in each
     initialization function, but suggest to initiate it only once. */
#ifdef PWMA_FCTRL0_INIT
  PWMA->FAULT[0].FCTRL = PWMA_FCTRL0_INIT;
#else
  PWMA->FAULT[0].FCTRL = 0x0U;
#endif /* PWMA_FCTRL0_INIT */
#ifdef PWMA_FSTS0_INIT
  PWMA->FAULT[0].FSTS = PWMA_FSTS0_INIT;
#else
  PWMA->FAULT[0].FSTS = 0xfU;
#endif /* PWMA_FSTS0_INIT */
#ifdef PWMA_FFILT0_INIT
  PWMA->FAULT[0].FFILT = PWMA_FFILT0_INIT;
#else
  PWMA->FAULT[0].FFILT = 0x0U;
#endif /* PWMA_FFILT0_INIT */
#ifdef PWMA_FTST0_INIT
  PWMA->FAULT[0].FTST = PWMA_FTST0_INIT;
#else
  PWMA->FAULT[0].FTST = 0x0U;
#endif /* PWMA_FTST0_INIT */
#ifdef PWM_FCTRL2_NOCOMB_MASK
#ifdef PWMA_FCTRL20_INIT
  PWMA->FAULT[0].FCTRL2 = PWMA_FCTRL20_INIT;
#else
  PWMA->FAULT[0].FCTRL2 = 0x0U;
#endif /* PWMA_FCTRL20_INIT */
#endif /* PWM_FCTRL2_NOCOMB_MASK */

/****************************************************************************/
/* Fault channel1 initialization */
/****************************************************************************/
  /* Fault setting are shared for all submodules, it is allowed to initiate it in each
     initialization function, but suggest to initiate it only once. */
#ifdef PWMA_FCTRL1_INIT
  PWMA->FAULT[1].FCTRL = PWMA_FCTRL1_INIT;
#else
  PWMA->FAULT[1].FCTRL = 0x0U;
#endif /* PWMA_FCTRL1_INIT */
#ifdef PWMA_FSTS1_INIT
  PWMA->FAULT[1].FSTS = PWMA_FSTS1_INIT;
#else
  PWMA->FAULT[1].FSTS = 0xfU;
#endif /* PWMA_FSTS1_INIT */
#ifdef PWMA_FFILT1_INIT
  PWMA->FAULT[1].FFILT = PWMA_FFILT1_INIT;
#else
  PWMA->FAULT[1].FFILT = 0x0U;
#endif /* PWMA_FFILT1_INIT */
#ifdef PWMA_FTST1_INIT
  PWMA->FAULT[1].FTST = PWMA_FTST1_INIT;
#else
  PWMA->FAULT[1].FTST = 0x0U;
#endif /* PWMA_FTST1_INIT */
#ifdef PWM_FCTRL2_NOCOMB_MASK
#ifdef PWMA_FCTRL21_INIT
  PWMA->FAULT[1].FCTRL2 = PWMA_FCTRL21_INIT;
#else
  PWMA->FAULT[1].FCTRL2 = 0x0U;
#endif /* PWMA_FCTRL21_INIT */
#endif /* PWM_FCTRL2_NOCOMB_MASK */

/****************************************************************************/
/* PWMA initialization */
/****************************************************************************/
#ifdef PWMA_OUTEN_INIT
  PWMA->OUTEN = (PWMA->OUTEN & (~PWMA_OUTEN_INIT_MASK)) | (PWMA_OUTEN_INIT & PWMA_OUTEN_INIT_MASK);
#endif /* PWMA_PWMA_OUTEN_INIT */
#ifdef PWMA_MASK_INIT
  PWMA->MASK = (PWMA->MASK & (~PWMA_MASK_INIT_MASK)) | (PWMA_MASK_INIT & PWMA_MASK_INIT_MASK);
#endif /* PWMA_PWMA_MASK_INIT */
#ifdef PWMA_SWCOUT_INIT
  PWMA->SWCOUT = (PWMA->SWCOUT & (~PWMA_SWCOUT_INIT_MASK)) | (PWMA_SWCOUT_INIT & PWMA_SWCOUT_INIT_MASK);
#endif /* PWMA_PWMA_SWCOUT_INIT */
#ifdef PWMA_DTSRCSEL_INIT
  PWMA->DTSRCSEL = (PWMA->DTSRCSEL & (~PWMA_DTSRCSEL_INIT_MASK)) | (PWMA_DTSRCSEL_INIT & PWMA_DTSRCSEL_INIT_MASK);
#endif /* PWMA_PWMA_DTSRCSEL_INIT */
#ifdef PWMA_MCTRL2_INIT
  PWMA->MCTRL2 = PWMA_MCTRL2_INIT;
#endif /* PWMA_PWMA_MCTRL2_INIT */
#ifdef PWMA_MCTRL_INIT
  PWMA->MCTRL = (PWMA->MCTRL & (~PWMA_MCTRL_INIT_MASK)) | (PWMA_MCTRL_INIT & PWMA_MCTRL_INIT_MASK);
#endif /* PWMA_PWMA_MCTRL_INIT */
#ifdef PWMA_SM0CTRL_INIT
#if ((!defined(PWMA_SM0CTRL2_INIT)) || (0U == (PWMA_SM0CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK)))
  PWMA->SM[0].CTRL2 |= PWM_CTRL2_FORCE(1U);
#endif /* ((!defined(PWMA_SM0CTRL2_INIT)) || (0U == (PWMA_SM0CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK))) */
#endif /* PWMA_SM0CTRL_INIT */
#ifdef PWMA_SM1CTRL_INIT
#if ((!defined(PWMA_SM1CTRL2_INIT)) || (0U == (PWMA_SM1CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK)))
  PWMA->SM[1].CTRL2 |= PWM_CTRL2_FORCE(1U);
#endif /* ((!defined(PWMA_SM1CTRL2_INIT)) || (0U == (PWMA_SM1CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK))) */
#endif /* PWMA_SM1CTRL_INIT */
#ifdef PWMA_SM2CTRL_INIT
#if ((!defined(PWMA_SM2CTRL2_INIT)) || (0U == (PWMA_SM2CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK)))
  PWMA->SM[2].CTRL2 |= PWM_CTRL2_FORCE(1U);
#endif /* ((!defined(PWMA_SM2CTRL2_INIT)) || (0U == (PWMA_SM2CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK))) */
#endif /* PWMA_SM2CTRL_INIT */
#ifdef PWMA_SM3CTRL_INIT
#if ((!defined(PWMA_SM3CTRL2_INIT)) || (0U == (PWMA_SM3CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK)))
  PWMA->SM[3].CTRL2 |= PWM_CTRL2_FORCE(1U);
#endif /* ((!defined(PWMA_SM3CTRL2_INIT)) || (0U == (PWMA_SM3CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK))) */
#endif /* PWMA_SM3CTRL_INIT */
}

