nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f83000evk/demo_apps/mc_pmsm/pmsm_enc/peripherals.c
/***********************************************************************************************************************
 * TMRA initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'TMRA'
- type: 'qtmr_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'qtmr_reg_19ff29c7d66f72ec59fde9c83852e6f9'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'TMRA'
- config_sets:
  - generalConfig:
    - clockSource: 'BusInterfaceClock'
    - clockSourceFreq: 'BOARD_BootClockRUN'
    - enable_timer_channels:
      - 0:
        - enableTimerChannel: 'true'
      - 1:
        - enableTimerChannel: 'true'
      - 2:
        - enableTimerChannel: 'true'
      - 3:
        - enableTimerChannel: 'true'
    - input_filters:
      - 0:
        - inputFilterPeriod: '0'
        - inputFilterCount: '3'
      - 1:
        - inputFilterPeriod: '0'
        - inputFilterCount: '3'
      - 2:
        - inputFilterPeriod: '0'
        - inputFilterCount: '3'
      - 3:
        - inputFilterPeriod: '0'
        - inputFilterCount: '3'
    - qtmr_channels:
      - 0:
        - channel: '0'
        - channelConfig:
          - primarySource: '8'
          - secondarySource: '0'
          - inputPolarity: 'false'
          - inputFault: 'false'
          - countingMode: '1'
          - enableCountOnce: 'false'
          - countLength: '0'
          - inputAltLoad: 'false'
          - countDirection: '0'
          - triggeredCountInit: '0'
          - enableMasterMode: 'false'
          - enableExternalForce: 'false'
          - enableCoChannelReinit: 'false'
          - outputMode: '0'
          - forceOutputValue: 'false'
          - forcedOutputValue: '0'
          - outputPolarity: 'false'
          - outputEnabled: 'false'
          - captureMode: '0'
          - reloadOnCapture: 'false'
          - compare1Period: '0'
          - compareLoadControl1: '0'
          - compare2Period: '0'
          - compareLoadControl2: '0'
          - compareLoad1: '0'
          - compareLoad2: '0'
          - counterLoad: '0'
          - counterInit: '0'
          - debugMode: '0'
          - interruptSources:
            - kQTMR_CompareInterruptEnable: 'false'
            - kQTMR_Compare1InterruptEnable: 'false'
            - kQTMR_Compare2InterruptEnable: 'false'
            - kQTMR_OverflowInterruptEnable: 'false'
            - kQTMR_EdgeInterruptEnable: 'false'
          - enable_irq: 'false'
          - interrupt:
            - IRQn: 'kTMRA_0_VECTORn'
            - dsc_enable_interrrupt: 'iprVal0'
            - enable_custom_name: 'false'
          - dma:
            - kQTMR_InputEdgeFlagDmaEnable: 'false'
            - kQTMR_ComparatorPreload1DmaEnable: 'false'
            - kQTMR_ComparatorPreload2DmaEnable: 'false'
        - template_params: []
    - qtmr_params: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void TMRA_init(void) {
/****************************************************************************/
/* Channel 0 initialization */
/****************************************************************************/
  /* Disable the channel before the module init*/
  TMRA->CHANNEL[0].ENBL &= ~(TMR_ENBL_ENBL(1U << 0));
  TMRA->CHANNEL[0].HOLD = 0x0U;
  TMRA->CHANNEL[0].CAPT = 0x0U;
#ifdef TMRA_COMP10_INIT
  TMRA->CHANNEL[0].COMP1 = TMRA_COMP10_INIT;
#else
  TMRA->CHANNEL[0].COMP1 = 0x0U;
#endif /*TMRA_COMP10_INIT*/
#ifdef TMRA_COMP20_INIT
  TMRA->CHANNEL[0].COMP2 = TMRA_COMP20_INIT;
#else
  TMRA->CHANNEL[0].COMP2 = 0x0U;
#endif /*TMRA_COMP20_INIT */
#ifdef TMRA_LOAD0_INIT
  TMRA->CHANNEL[0].LOAD = TMRA_LOAD0_INIT;
#else
  TMRA->CHANNEL[0].LOAD = 0x0U;
#endif /*TMRA_LOAD0_INIT */
#ifdef TMRA_CNTR0_INIT
  TMRA->CHANNEL[0].CNTR = TMRA_CNTR0_INIT;
#else
  TMRA->CHANNEL[0].CNTR = 0x0U;
#endif /*TMRA_CNTR0_INIT */
#ifdef TMRA_SCTRL0_INIT
  TMRA->CHANNEL[0].SCTRL = TMRA_SCTRL0_INIT;
#else
  TMRA->CHANNEL[0].SCTRL = 0x0U;
#endif /*TMRA_SCTRL0_INIT */
#ifdef TMRA_CMPLD10_INIT
  TMRA->CHANNEL[0].CMPLD1 = TMRA_CMPLD10_INIT;
#else
  TMRA->CHANNEL[0].CMPLD1 = 0x0U;
#endif /*TMRA_CMPLD10_INIT */
#ifdef TMRA_CMPLD20_INIT
  TMRA->CHANNEL[0].CMPLD2 = TMRA_CMPLD20_INIT;
#else
  TMRA->CHANNEL[0].CMPLD2 = 0x0U;
#endif /*TMRA_CMPLD20_INIT */
#ifdef TMRA_CSCTRL0_INIT
  TMRA->CHANNEL[0].CSCTRL = TMRA_CSCTRL0_INIT;
#else
  TMRA->CHANNEL[0].CSCTRL = 0x0U;
#endif /*TMRA_CSCTRL0_INIT */
#ifdef TMRA_DMA0_INIT
  TMRA->CHANNEL[0].DMA = TMRA_DMA0_INIT;
#else
  TMRA->CHANNEL[0].DMA = 0x0U;
#endif /*TMRA_DMA0_INIT */
#ifdef TMRA_CTRL0_INIT
  TMRA->CHANNEL[0].CTRL = TMRA_CTRL0_INIT;
#else
  TMRA->CHANNEL[0].CTRL = 0x0U;
#endif /*TMRA_CTRL0_INIT */
/****************************************************************************/
/* Quad timer global initialization */
/****************************************************************************/
  /* Input filters configuration */
#ifdef TMRA_FILT0_INIT
  TMRA->CHANNEL[0].FILT = TMRA_FILT0_INIT;
#else
  TMRA->CHANNEL[0].FILT = 0x0U;
#endif /*TMRA_FILT0_INIT */
#ifdef TMRA_FILT1_INIT
  TMRA->CHANNEL[1].FILT = TMRA_FILT1_INIT;
#else
  TMRA->CHANNEL[1].FILT = 0x0U;
#endif /*TMRA_FILT1_INIT */
#ifdef TMRA_FILT2_INIT
  TMRA->CHANNEL[2].FILT = TMRA_FILT2_INIT;
#else
  TMRA->CHANNEL[2].FILT = 0x0U;
#endif /*TMRA_FILT2_INIT */
#ifdef TMRA_FILT3_INIT
  TMRA->CHANNEL[3].FILT = TMRA_FILT3_INIT;
#else
  TMRA->CHANNEL[3].FILT = 0x0U;
#endif /*TMRA_FILT3_INIT */
  /* Synchronous start of all channels */
#if defined(TMRA_ENBL_INIT)
   TMRA->CHANNEL[0].ENBL = (TMRA->CHANNEL[0].ENBL & (~TMRA_ENBL_INIT_MASK)) | (TMRA_ENBL_INIT & TMRA_ENBL_INIT_MASK);
#endif /*TMRA_TMRA_ENBL_INIT */
}

/***********************************************************************************************************************
 * TMRB initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'TMRB'
- type: 'qtmr_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'qtmr_reg_19ff29c7d66f72ec59fde9c83852e6f9'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'TMRB'
- config_sets:
  - generalConfig:
    - clockSource: 'BusInterfaceClock'
    - clockSourceFreq: 'ClocksTool_DefaultInit'
    - enable_timer_channels:
      - 0:
        - enableTimerChannel: 'true'
      - 1:
        - enableTimerChannel: 'false'
      - 2:
        - enableTimerChannel: 'false'
      - 3:
        - enableTimerChannel: 'false'
    - input_filters:
      - 0:
        - inputFilterPeriod: '0'
        - inputFilterCount: '3'
      - 1:
        - inputFilterPeriod: '0'
        - inputFilterCount: '3'
      - 2:
        - inputFilterPeriod: '0'
        - inputFilterCount: '3'
      - 3:
        - inputFilterPeriod: '0'
        - inputFilterCount: '3'
    - qtmr_channels:
      - 0:
        - channel: '0'
        - channelConfig:
          - primarySource: '0'
          - primarySourceFreq: 'N/A'
          - secondarySource: '1'
          - inputPolarity: 'false'
          - inputFault: 'false'
          - countingMode: '4'
          - enableCountOnce: 'false'
          - countLength: '1'
          - inputAltLoad: 'false'
          - countDirection: '0'
          - triggeredCountInit: '1'
          - enableMasterMode: 'false'
          - enableExternalForce: 'false'
          - enableCoChannelReinit: 'false'
          - outputMode: '0'
          - forceOutputValue: 'false'
          - forcedOutputValue: '0'
          - outputPolarity: 'false'
          - outputEnabled: 'false'
          - captureMode: '3'
          - reloadOnCapture: 'false'
          - compare1Period: '0'
          - compareLoadControl1: '0'
          - compare2Period: '0'
          - compareLoadControl2: '0'
          - compareLoad1: '0'
          - compareLoad2: '0'
          - counterLoad: '0'
          - counterInit: '0'
          - debugMode: '0'
          - interruptSources:
            - kQTMR_CompareInterruptEnable: 'false'
            - kQTMR_Compare1InterruptEnable: 'false'
            - kQTMR_Compare2InterruptEnable: 'false'
            - kQTMR_OverflowInterruptEnable: 'false'
            - kQTMR_EdgeInterruptEnable: 'false'
          - enable_irq: 'false'
          - interrupt:
            - IRQn: 'kTMRB_0_VECTORn'
            - dsc_enable_interrrupt: 'iprVal0'
            - enable_custom_name: 'false'
          - dma:
            - kQTMR_InputEdgeFlagDmaEnable: 'false'
            - kQTMR_ComparatorPreload1DmaEnable: 'false'
            - kQTMR_ComparatorPreload2DmaEnable: 'false'
        - template_params: []
    - qtmr_params: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void TMRB_init(void) {
/****************************************************************************/
/* Channel 0 initialization */
/****************************************************************************/
  /* Disable the channel before the module init*/
  TMRB->CHANNEL[0].ENBL &= ~(TMR_ENBL_ENBL(1U << 0));
  TMRB->CHANNEL[0].HOLD = 0x0U;
  TMRB->CHANNEL[0].CAPT = 0x0U;
#ifdef TMRB_COMP10_INIT
  TMRB->CHANNEL[0].COMP1 = TMRB_COMP10_INIT;
#else
  TMRB->CHANNEL[0].COMP1 = 0x0U;
#endif /*TMRB_COMP10_INIT*/
#ifdef TMRB_COMP20_INIT
  TMRB->CHANNEL[0].COMP2 = TMRB_COMP20_INIT;
#else
  TMRB->CHANNEL[0].COMP2 = 0x0U;
#endif /*TMRB_COMP20_INIT */
#ifdef TMRB_LOAD0_INIT
  TMRB->CHANNEL[0].LOAD = TMRB_LOAD0_INIT;
#else
  TMRB->CHANNEL[0].LOAD = 0x0U;
#endif /*TMRB_LOAD0_INIT */
#ifdef TMRB_CNTR0_INIT
  TMRB->CHANNEL[0].CNTR = TMRB_CNTR0_INIT;
#else
  TMRB->CHANNEL[0].CNTR = 0x0U;
#endif /*TMRB_CNTR0_INIT */
#ifdef TMRB_SCTRL0_INIT
  TMRB->CHANNEL[0].SCTRL = TMRB_SCTRL0_INIT;
#else
  TMRB->CHANNEL[0].SCTRL = 0x0U;
#endif /*TMRB_SCTRL0_INIT */
#ifdef TMRB_CMPLD10_INIT
  TMRB->CHANNEL[0].CMPLD1 = TMRB_CMPLD10_INIT;
#else
  TMRB->CHANNEL[0].CMPLD1 = 0x0U;
#endif /*TMRB_CMPLD10_INIT */
#ifdef TMRB_CMPLD20_INIT
  TMRB->CHANNEL[0].CMPLD2 = TMRB_CMPLD20_INIT;
#else
  TMRB->CHANNEL[0].CMPLD2 = 0x0U;
#endif /*TMRB_CMPLD20_INIT */
#ifdef TMRB_CSCTRL0_INIT
  TMRB->CHANNEL[0].CSCTRL = TMRB_CSCTRL0_INIT;
#else
  TMRB->CHANNEL[0].CSCTRL = 0x0U;
#endif /*TMRB_CSCTRL0_INIT */
#ifdef TMRB_DMA0_INIT
  TMRB->CHANNEL[0].DMA = TMRB_DMA0_INIT;
#else
  TMRB->CHANNEL[0].DMA = 0x0U;
#endif /*TMRB_DMA0_INIT */
#ifdef TMRB_CTRL0_INIT
  TMRB->CHANNEL[0].CTRL = TMRB_CTRL0_INIT;
#else
  TMRB->CHANNEL[0].CTRL = 0x0U;
#endif /*TMRB_CTRL0_INIT */
/****************************************************************************/
/* Quad timer global initialization */
/****************************************************************************/
  /* Input filters configuration */
#ifdef TMRB_FILT0_INIT
  TMRB->CHANNEL[0].FILT = TMRB_FILT0_INIT;
#else
  TMRB->CHANNEL[0].FILT = 0x0U;
#endif /*TMRB_FILT0_INIT */
#ifdef TMRB_FILT1_INIT
  TMRB->CHANNEL[1].FILT = TMRB_FILT1_INIT;
#else
  TMRB->CHANNEL[1].FILT = 0x0U;
#endif /*TMRB_FILT1_INIT */
#ifdef TMRB_FILT2_INIT
  TMRB->CHANNEL[2].FILT = TMRB_FILT2_INIT;
#else
  TMRB->CHANNEL[2].FILT = 0x0U;
#endif /*TMRB_FILT2_INIT */
#ifdef TMRB_FILT3_INIT
  TMRB->CHANNEL[3].FILT = TMRB_FILT3_INIT;
#else
  TMRB->CHANNEL[3].FILT = 0x0U;
#endif /*TMRB_FILT3_INIT */
  /* Synchronous start of all channels */
#if defined(TMRB_ENBL_INIT)
   TMRB->CHANNEL[0].ENBL = (TMRB->CHANNEL[0].ENBL & (~TMRB_ENBL_INIT_MASK)) | (TMRB_ENBL_INIT & TMRB_ENBL_INIT_MASK);
#endif /*TMRB_TMRB_ENBL_INIT */
}

