nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f83000evk/demo_apps/mc_pmsm/pmsm_enc/peripherals.c
/***********************************************************************************************************************
 * FreeMASTER initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'FreeMASTER'
- type: 'freemaster'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'freemaster_14894d49d87e02d0dca5f799e22554da'
- functional_group: 'BOARD_InitPeripherals'
- config_sets:
  - freemaster_config:
    - FMSTR_DISABLE: 'false'
    - initFreemaster: 'true'
    - generalConfig:
      - commInterface: 'serial'
      - interruptMode: 'polling'
      - initType: 'false'
      - serialConfig:
        - peripheralUART: 'QSCI0'
        - clockSource: 'genericUartClockSource'
        - clockSourceFreq: 'BOARD_BootClockRUN'
        - u32BaudRateBps: '115200'
        - parityMode_qsci: 'kQSCI_ParityDisabled'
        - dataBitCount_qsci: 'kQSCI_Data8Bit'
        - polarityMode_qsci: 'kQSCI_PolarityNormal'
        - enableUserInit: 'false'
        - user_init:
          - initFunctionID: 'SERIAL_communication_init'
        - enable_rx_irq: 'false'
        - interrupt_rx:
          - IRQn: 'kQSCI0_RCV_VECTORn'
          - dsc_enable_interrrupt: ''
          - useDefaultISR: 'false'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
        - enable_tx_irq: 'false'
        - interrupt_tx:
          - IRQn: 'kQSCI0_TDRE_VECTORn'
          - dsc_enable_interrrupt: ''
          - useDefaultISR: 'false'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
        - enable_err_irq: 'false'
        - interrupt_error:
          - IRQn: 'kQSCI0_RERR_VECTORn'
          - dsc_enable_interrrupt: ''
          - useDefaultISR: 'false'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
        - enable_tridle_irq: 'false'
        - interrupt_tridle:
          - IRQn: 'kQSCI0_TRIDLE_VECTORn'
          - dsc_enable_interrrupt: ''
          - useDefaultISR: 'false'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
      - canConfig:
        - peripheralCAN: 'CAN0'
        - generic_can_driver_version: '2.1.1'
        - clockSource: 'kFLEXCAN_ClkSrc0'
        - clockSourceFreq: 'BOARD_BootClockRUN'
        - dscFlexcanConfig:
          - baudRate: '500000'
        - enableUserInit: 'false'
        - user_init:
          - initFunctionID: 'CAN_communication_init'
        - enable_flexcan_mb_irq: 'true'
        - flexcan_interrupt_mb:
          - IRQn: 'kCAN_MB_OR_VECTORn'
          - dsc_enable_interrrupt: ''
          - useDefaultISR: 'true'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
        - enable_flexcan_busoff_irq: 'true'
        - flexcan_interrupt_busoff:
          - IRQn: 'kCAN_BUS_OFF_VECTORn'
          - dsc_enable_interrrupt: ''
          - useDefaultISR: 'true'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
        - enable_flexcan_error_irq: 'true'
        - flexcan_interrupt_error:
          - IRQn: 'kCAN_ERROR_VECTORn'
          - dsc_enable_interrrupt: ''
          - useDefaultISR: 'true'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
        - enable_flexcan_txwarn_irq: 'true'
        - flexcan_interrupt_txwarn:
          - IRQn: 'kCAN_TX_WARN_VECTORn'
          - dsc_enable_interrrupt: ''
          - useDefaultISR: 'true'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
        - enable_flexcan_rxwarn_irq: 'true'
        - flexcan_interrupt_rxwarn:
          - IRQn: 'kCAN_RX_WARN_VECTORn'
          - dsc_enable_interrrupt: ''
          - useDefaultISR: 'true'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
        - enable_flexcan_wakeup_irq: 'true'
        - flexcan_interrupt_wakeup:
          - IRQn: 'kCAN_WAKEUP_VECTORn'
          - dsc_enable_interrrupt: ''
          - useDefaultISR: 'true'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
        - quick_selection: 'QuickSelection1'
      - dsc_eonce_config:
        - txRegInterruptEnable: 'false'
        - tx_interrupt_vector:
          - IRQn: 'kTX_REG_VECTORn'
          - dsc_enable_interrrupt: ''
          - useDefaultISR: 'false'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
        - rxRegInterruptEnable: 'false'
        - rx_interrupt_vector:
          - IRQn: 'kRX_REG_VECTORn'
          - dsc_enable_interrrupt: ''
          - useDefaultISR: 'false'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
      - FMSTR_FLEXCAN_TXMB: '0'
      - FMSTR_FLEXCAN_RXMB: '0'
      - mcanRamConfig:
        - RAMbufferType: 'default'
        - bufferAddressValue: '0'
        - bufferAddress: ''
        - bufferExternDef: ''
        - mcan_tx: '0'
        - mcan_rx: '0'
      - FMSTR_COMM_BUFFER_SIZE: 'autoSize'
      - FMSTR_COMM_RQUEUE_SIZE: '32'
      - FMSTR_USE_SCOPE: '2'
      - FMSTR_MAX_SCOPE_VARS: '8'
      - FMSTR_REC_FLOAT_TRIG: 'false'
      - recorders:
        - 0:
          - recID:
            - enableCustomID: 'true'
            - customID: 'FreeMASTER_Recorder_FL'
          - nameRec: 'Fast Loop recorder'
          - recBuff:
            - customBuffer: 'false'
            - bufferAddress: ''
            - bufferExternDef: ''
            - bufferSize: '4096'
          - basePeriod_ns: '100000'
          - recInit: 'true'
      - FMSTR_USE_TSA: 'false'
      - FMSTR_USE_TSA_INROM: 'false'
      - FMSTR_USE_TSA_SAFETY: 'false'
      - FMSTR_USE_TSA_DYNAMIC: 'false'
      - tsaBufferInit: 'false'
      - tsaBuff:
        - customBuffer: 'false'
        - bufferAddress: ''
        - bufferExternDef: ''
        - bufferSize: ''
      - pipes: []
      - FMSTR_USE_READMEM: 'true'
      - FMSTR_USE_WRITEMEM: 'true'
      - FMSTR_USE_WRITEMEMMASK: 'true'
      - passR: ''
      - passRW: ''
      - passRWF: ''
      - FMSTR_USE_HASHED_PASSWORDS: 'false'
      - FMSTR_USE_APPCMD: 'false'
      - FMSTR_APPCMD_BUFF_SIZE: '32'
      - FMSTR_MAX_APPCMD_CALLS: '8'
      - FMSTR_DEBUG_LEVEL: '0'
      - FMSTR_DEBUG_PRINTF: 'debug_console'
      - FMSTR_DEBUG_TX: 'false'
      - FMSTR_CUSTOM_INCLUDES: '#include "fsl_common.h"'
      - FMSTR_CUSTOM_OPTIONS: '#ifdef DATA_IN_XFLASH\n// Target-side address translation (TSA)\n#define FMSTR_TSA_CDECL const __declspec(DATA_IN_XFLASH) __attribute__((far))\n#undef  FMSTR_USE_TSA\n#define
        FMSTR_USE_TSA           0   // Enable TSA functionality\n#endif // DATA_IN_XFLASH'
    - freemaster_codegenerator: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */
/* QSCI configuration structure */
qsci_config_t FreeMASTER_serial_config;
/* Recorder0 configuration */
FMSTR_U8 FreeMASTER_RecBuffer0[FREEMASTER_REC_0_SIZE];
FMSTR_REC_BUFF FreeMASTER_Recorder_FL = {
  .name = "Fast Loop recorder",
  .addr = (FMSTR_ADDR)FreeMASTER_RecBuffer0,
  .size = (FMSTR_SIZE) sizeof(FreeMASTER_RecBuffer0),
  .basePeriod_ns = 100000UL
};

static void FreeMASTER_init(void) {
  /* Serial communication peripheral initialization */

  /* Get QSCI default configuration and modify it */
  QSCI_GetDefaultConfig(&FreeMASTER_serial_config, FREEMASTER_SERIAL_PERIPHERAL_BAUDRATE, FREEMASTER_SERIAL_PERIPHERAL_CLK_FREQ);

  FreeMASTER_serial_config.eParityMode = kQSCI_ParityDisabled;
  FreeMASTER_serial_config.eDataBitMode = kQSCI_Data8Bit;
  FreeMASTER_serial_config.ePolarityMode = kQSCI_PolarityNormal;

