nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f83000evk/demo_apps/mc_pmsm/pmsm_enc/peripherals.c
  /* Initialize QSCI module. */
  QSCI_Init(FREEMASTER_SERIAL_PERIPHERAL, &FreeMASTER_serial_config);
  /* FreeMASTER middleware initialization */
  FMSTR_Init();
  /* FreeMASTER recorder 0 configuration initialization  */
  FMSTR_RecorderCreate(0, &FreeMASTER_Recorder_FL);
}

/***********************************************************************************************************************
 * Initialization functions
 **********************************************************************************************************************/
static void BOARD_InitPeripherals_CommonPreInit(void)
{
  /* Enable clock gate of the ADC peripheral. */
  SIM->PCE2 |= SIM_PCE2_CYCADC_MASK;
  /* Enable clock gate of the CMPC peripheral. */
  SIM->PCE2 |= SIM_PCE2_CMPC_MASK;
  /* Disable all interrupts to prevent invoking of any interrupt during initialization of peripherals. */
  INTC->CTRL |= INTC_CTRL_INT_DIS_MASK;
  /* Enable clock gate of the PIT0 peripheral. */
  SIM->PCE2 |= SIM_PCE2_PIT0_MASK;
  /* Enable clock gate of the PWMA peripheral. */
  SIM->PCE3 |= SIM_PCE3_PWMACH0_MASK;
  /* Enable clock gate of the PWMA peripheral. */
  SIM->PCE3 |= SIM_PCE3_PWMACH1_MASK;
  /* Enable clock gate of the PWMA peripheral. */
  SIM->PCE3 |= SIM_PCE3_PWMACH2_MASK;
  /* Enable clock gate of the TMRA peripheral. */
  SIM->PCE0 |= SIM_PCE0_TA0_MASK;
  /* Enable clock gate of the TMRB peripheral. */
  SIM->PCE0 |= SIM_PCE0_TB0_MASK;
}

static void BOARD_InitPeripherals_CommonPostInit(void)
{
  /* Set the interrupt priority: Priority 2 of the kADC12_CC0_VECTORn request in the INTC. */
  INTC->IPR2 = (INTC->IPR2 & ~INTC_IPR2_ADC_CC0_MASK) | INTC_IPR2_ADC_CC0(3);
  /* Set the interrupt priority: Priority 0 of the kGPIOF_VECTORn request in the INTC. */
  INTC->IPR11 = (INTC->IPR11 & ~INTC_IPR11_GPIOF_MASK) | INTC_IPR11_GPIOF(1);
  /* Set the interrupt priority: Priority 1 of the kPIT0_ROLLOVR_VECTORn request in the INTC. */
  INTC->IPR10 = (INTC->IPR10 & ~INTC_IPR10_PIT0_ROLLOVR_MASK) | INTC_IPR10_PIT0_ROLLOVR(2);
  /* Enable all interrupts after initialization of peripherals. */
  INTC->CTRL &= ~INTC_CTRL_INT_DIS_MASK;
  /* Initialization of masked/enabled DSC core interrupt levels. */
  __EI(3);
}

void BOARD_InitPeripherals(void)
{
  /* Common pre-initialization */
  BOARD_InitPeripherals_CommonPreInit();
  /* Initialize components */
  ADC_init();
  CMPC_init();
  PIT0_init();
  PWMA_init();
  TMRA_init();
  TMRB_init();
  FreeMASTER_init();
  /* Common post-initialization */
  BOARD_InitPeripherals_CommonPostInit();
}

/***********************************************************************************************************************
 * BOARD_InitBootPeripherals function
 **********************************************************************************************************************/
void BOARD_InitBootPeripherals(void)
{
  BOARD_InitPeripherals();
}
